---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsAttrMaxRiserHeight
source: html/7ef7f9fe-72a2-ebb0-d099-c3b6731c4293.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsAttrMaxRiserHeight Property

"Maximum Riser Height"

## Syntax (C#)
```csharp
public static ForgeTypeId StairsAttrMaxRiserHeight { get; }
```